tap "borkdude/brew"
tap "clojure/tools"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "mongodb/brew"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Spell checker with better logic than ispell
brew "aspell"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Diff that understands syntax
brew "difftastic"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Kubernetes package manager
brew "helm"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Command-line, double-entry accounting tool
brew "ledger"
# GNOME XML library
brew "libxml2"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Run a Kubernetes cluster locally
brew "minikube"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Draw UML diagrams
brew "plantuml"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Temporal CLI (tctl)
brew "tctl"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Tracks most-used directories to make cd smarter
brew "z"
# UNIX shell (command interpreter)
brew "zsh"
# Native, fast starting Clojure interpreter for scripting.
brew "borkdude/brew/babashka"
# Transform JSON into EDN into Transit.
brew "borkdude/brew/jet"
# The Clojure Programming Language
brew "clojure/tools/clojure"
# Terraform
brew "hashicorp/tap/terraform"
# This package contains standard utilities for interacting with MongoDB.
brew "mongodb/brew/mongodb-database-tools"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Corporate typeface for IBM
cask "font-ibm-plex-mono"
# Sans-serif, slab-serif, monospace and quasi‑proportional typeface family
cask "font-iosevka"
cask "font-m-plus-1"
cask "font-m-plus-1-code"
cask "font-m-plus-2"
cask "font-m-plus-code-latin"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Utility to fix grammar errors and style issues in text
cask "grammarly"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
mas "1Password for Safari", id: 1569813296
mas "Bear", id: 1091189122
mas "eDrawings", id: 1209754386
mas "Flow", id: 1423210932
mas "GarageBand", id: 682658836
mas "Grammarly for Safari", id: 1462114288
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Save to Pocket", id: 1477385213
mas "Save to Raindrop.io", id: 1549370672
mas "Things", id: 904280696
mas "Xcode", id: 497799835
mas "‎WhatsApp", id: 310633997
vscode "arcticicestudio.nord-visual-studio-code"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "bradlc.vscode-tailwindcss"
vscode "djblue.portal"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "foxundermoon.shell-format"
vscode "gargakshit.theme-alabaster-dark"
vscode "hashicorp.terraform"
vscode "huytd.nord-light"
vscode "jebbs.plantuml"
vscode "junstyle.css-formatter"
vscode "mhutchie.git-graph"
vscode "mitchdenny.ecdc"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "tonsky.theme-alabaster"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
